int n = int.Parse(Console.ReadLine()); //четем от к

for (int i = 1; i <= 9 ; i++) //завъртаме цикъл за позициите на числото на първа позиция
{
    for (int k = 1; k <= 9 ; k++) //за числото на втора позиция
    {
        for (int l = 1; l <= 9; l++) //за числото на трета позиия
        {
            for (int j = 1; j <= 9; j++) //за числото на четвърта позиция
            {
                if (n % i ==0 && n % k == 0 && n % l == 0 && n % j == 0)
                Console.Write($"{i}{k}{l}{j} "); //за да печата на един ред, както е по условие
            }
        }
    }
}
